src/InformationRegisters/ОписаниеДняПоСодержанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеДняПоСодержанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СодержаниеДня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СодержаниеДня</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОписаниеДняПоСодержанию/Ext/ManagerModule.bsl
Функция ЗаписатьЗначение(СодержаниеДня, Дата, Описание) Экспорт

	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ТекущееЗначение = ПрочитатьЗначение(СодержаниеДня, Дата, Пользователь);
	
	Если ТекущееЗначение.Описание <> Описание Тогда
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.СодержаниеДня = СодержаниеДня;
		МенеджерЗаписи.Дата = Дата;
		МенеджерЗаписи.Пользователь = Пользователь;
		
		МенеджерЗаписи.Описание = Описание;
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;		
КонецФункции
 
Функция ПрочитатьЗначение(СодержаниеДня, Дата, Пользователь) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОписаниеДняПоСодержанию.СодержаниеДня,
		|	ОписаниеДняПоСодержанию.Пользователь,
		|	ОписаниеДняПоСодержанию.Дата,
		|	ОписаниеДняПоСодержанию.Описание
		|ИЗ
		|	РегистрСведений.ОписаниеДняПоСодержанию КАК ОписаниеДняПоСодержанию
		|ГДЕ
		|	ОписаниеДняПоСодержанию.Дата = &Дата
		|	И ОписаниеДняПоСодержанию.Пользователь = &Пользователь
		|	И ОписаниеДняПоСодержанию.СодержаниеДня = &СодержаниеДня";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("СодержаниеДня", СодержаниеДня);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Новый Структура("Описание", ВыборкаДетальныеЗаписи.Описание);
	Иначе
		Возврат Новый Структура("Описание", "");
	КонецЕсли;	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;

КонецФункции
